In [1]:
import pandas as pd
import os

In [2]:
file = os.path.join("..","Resources","purchase_data.csv")

In [3]:
df = pd.read_csv(file)
df.head(5)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
# Returns number of SN/user name
total_players = len(df["SN"].unique())
total_players

576

In [43]:
# Creates a list of all the unique items and then a count of all the items
unique_items = df["Item Name"].unique()
total_items = len(unique_items)

In [44]:
# Calculates the mean of the Price column
average_purchase = df["Price"].mean()
# Calculates total revenue by adding the column
total_revenue = df["Price"].sum()
# Calculates total purchases
total_purchases = df["SN"].count()

In [45]:
purchasing_analysis_df = pd.DataFrame([{
    "Number of Unique Items": total_items,
    "Average Price": average_purchase,
    "Total Purchases": total_purchases,
    "Total Revenue": total_revenue
}])
purchasing_analysis_df

   Number of Unique Items  Average Price  Total Purchases  Total Revenue
0                     179       3.050987              780        2379.77

In [46]:
# Creates a data frame to analyze demographic information
demographics_df = df[["SN","Gender"]]

In [47]:
genders = ["Male", "Female", "Other / Non-Disclosed"]

In [48]:
# Removes players who made duplicate purchases to accurately estimate demographic breakup of players
player_df = demographics_df.drop_duplicates()
# Creates variables for number of players by gender
unique_players_by_gender = player_df["Gender"].value_counts().to_list()

In [49]:
# Stores demographic breakup of players
percent_by_gender = [round(x / total_players, 2) for x in unique_players_by_gender]
percent_by_gender

[0.84, 0.14, 0.02]

In [51]:
gender_demographics_df = pd.DataFrame({
    "Gender": genders,
    "Number of Players": unique_players_by_gender,
    "Percentage of Players": percent_by_gender
})
gender_demographics_df

                  Gender  Number of Players  Percentage of Players
0                   Male                484                   0.84
1                 Female                 81                   0.14
2  Other / Non-Disclosed                 11                   0.02

In [52]:
# Creates df for purchasing analysis by gender
purchases_df = df[["Age","Gender","Item Name","Price"]]

In [53]:
purchases_by_gender = purchases_df["Gender"].value_counts().to_list()
purchases_by_gender

[652, 113, 15]

In [54]:
# Stores average purchase by gender
average_male_purchases = round(purchases_df.loc[purchases_df["Gender"] == "Male","Price"].mean(), 2)
average_female_purchases = round(purchases_df.loc[purchases_df["Gender"] == "Female","Price"].mean(), 2)
average_other_purchases = round(purchases_df.loc[purchases_df["Gender"] == "Other / Non-Disclosed","Price"].mean(), 2)
average_purchases_by_gender = [average_male_purchases, average_female_purchases, average_other_purchases]
average_purchases_by_gender

[3.02, 3.2, 3.35]

In [55]:
# Stores value for total purchase value by gender
total_male_purchases = round(purchases_df.loc[purchases_df["Gender"] == "Male","Price"].sum(), 2)
total_female_purchases = round(purchases_df.loc[purchases_df["Gender"] == "Female","Price"].sum(), 2)
total_other_purchases = round(purchases_df.loc[purchases_df["Gender"] == "Other / Non-Disclosed","Price"].sum(), 2)
total_purchases_by_gender = [total_male_purchases, total_female_purchases, total_other_purchases]
total_purchases_by_gender

[1967.64, 361.94, 50.19]

In [56]:
# Creates a group by for average purchase per person by gender
purchases_by_person = df.groupby(["SN","Gender"],as_index=False)

In [57]:
# Creates a dataframe with the group by object to show the total spend by each screen name
individual_player_spend = purchases_by_person[["Price"]].sum()
individual_player_spend

                SN  Gender  Price
0     Adairialis76    Male   2.28
1      Adastirin33  Female   4.48
2           Aeda94    Male   4.91
3           Aela59    Male   4.32
4        Aelaria33    Male   1.79
..             ...     ...    ...
571     Yathecal82  Female   6.22
572     Yathedeu43    Male   6.02
573  Yoishirrala98  Female   4.58
574     Zhisrisu83    Male   7.89
575      Zontibe81    Male   8.03

[576 rows x 3 columns]

In [58]:
# Stores average total per person purchase by gender
average_male_spend = round(individual_player_spend.loc[individual_player_spend["Gender"] == "Male","Price"].mean(), 2)
average_female_spend = round(individual_player_spend.loc[individual_player_spend["Gender"] == "Female","Price"].mean(), 2)
average_other_spend = round(individual_player_spend.loc[individual_player_spend["Gender"] == "Other / Non-Disclosed","Price"].mean(), 2)
average_individual_spend = [average_male_spend, average_female_spend, average_other_spend]

In [59]:
gender_purchases_df = pd.DataFrame({
    "Gender": genders,
    "Average Purchase Value": average_purchases_by_gender,
    "Total Purchase Value": total_purchases_by_gender,
    "Average Total Purchase Per Person": average_individual_spend
})
gender_purchases_df

,Gender,Average Purchase Value,Total Purchase Value,Average Total Purchase Per Person
0,Male,3.02,1967.64,4.07
1,Female,3.20,361.94,4.47
2,Other / Non-Disclosed,3.35,50.19,4.56

In [60]:
# Create the age bins for analysis
bins = [0, 9, 14, 19, 24, 29, 34, 39, df["Age"].max()]

In [61]:
bin_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [62]:
# Creates group by object for each age group
groups = df.groupby(pd.cut(df["Age"], bins))

In [63]:
# Purchases by age bracket
purchase_count_by_age = round(groups["Price"].count()).to_list()
purchase_count_by_age

[23, 28, 136, 365, 101, 73, 41, 13]

In [64]:
# Average purchase by age bracket
average_purchase_by_age = round(groups["Price"].mean(), 2).to_list()
average_purchase_by_age

[3.35, 2.96, 3.04, 3.05, 2.9, 2.93, 3.6, 2.94]

In [65]:
# Total purcahse value by age bracket
total_purchase_by_age = groups["Price"].sum().to_list()
total_purchase_by_age

[77.13, 82.78, 412.89, 1114.06, 293.0, 214.0, 147.67000000000002, 38.24]

In [66]:
# Creates a DF from the groupby object after grouping the original data by SN. Will use DF created to bin each user by age.
users_by_age = df.groupby(["SN","Age"],as_index=False).sum()
users_by_age

                SN  Age  Purchase ID  Item ID  Price
0     Adairialis76   16          467      123   2.28
1      Adastirin33   35          142      175   4.48
2           Aeda94   17          388      128   4.91
3           Aela59   21           28      119   4.32
4        Aelaria33   23          630      171   1.79
..             ...  ...          ...      ...    ...
571     Yathecal82   20         1400      241   6.22
572     Yathedeu43   22          688      143   6.02
573  Yoishirrala98   17          572      145   4.58
574     Zhisrisu83   10          195       85   7.89
575      Zontibe81   21         1019      247   8.03

[576 rows x 5 columns]

In [67]:
# Takes DF created above and bins it by age so that each user is only counted once
binned_age_df = users_by_age.groupby(pd.cut(users_by_age["Age"], bins))
players_by_age = binned_age_df["SN"].count().to_list()
players_by_age

[17, 22, 107, 258, 77, 52, 31, 12]

In [68]:
percent_players_by_age = round((binned_age_df["SN"].count() / users_by_age["SN"].count()) * 100, 2).to_list()
percent_players_by_age

[2.95, 3.82, 18.58, 44.79, 13.37, 9.03, 5.38, 2.08]

In [69]:
average_individual_spend_age = round(binned_age_df["Price"].mean(), 2).to_list()
average_individual_spend_age

[4.54, 3.76, 3.86, 4.32, 3.81, 4.12, 4.76, 3.19]

In [70]:
age_demographics_df = pd.DataFrame({
    "Age": bin_labels,
    "Total Count": players_by_age,
    "Percentage of Players": percent_players_by_age,
})
age_demographics_df

     Age  Total Count  Percentage of Players
0    <10           17                   2.95
1  10-14           22                   3.82
2  15-19          107                  18.58
3  20-24          258                  44.79
4  25-29           77                  13.37
5  30-34           52                   9.03
6  35-39           31                   5.38
7    40+           12                   2.08

In [71]:
age_purchases_df = pd.DataFrame({
    "Age": bin_labels,
    "Total Count": purchase_count_by_age,
    "Average Purchase Price": total_purchase_by_age,
    "Average Total Purchase per Person": average_individual_spend_age
})
age_purchases_df

,Age,Total Count,Average Purchase Price,Average Total Purchase per Person
0,<10,23,77.13,4.54
1,10-14,28,82.78,3.76
2,15-19,136,412.89,3.86
3,20-24,365,1114.06,4.32
4,25-29,101,293.00,3.81
5,30-34,73,214.00,4.12
6,35-39,41,147.67,4.76
7,40+,13,38.24,3.19

In [72]:
# Top Spenders Analysis
# Filters the users by age DF for the 5 usernames with the highest cumulative Price
top_spenders = users_by_age.nlargest(n=5, columns=["Price"])
top_5_total_purchase = top_spenders["Price"].to_list()

In [73]:
# Creates a list for the top 5 usernames
top_5_sn = top_spenders["SN"].to_list()
top_5_sn

['Lisosia93', 'Idastidru52', 'Chamjask73', 'Iral74', 'Iskadarya95']

In [74]:
# Creates a list of the total purchase value for each top 5 screen name
top_5_total_purchase = round(top_spenders["Price"], 2).to_list()
top_5_total_purchase

[18.96, 15.45, 13.83, 13.62, 13.1]

In [75]:
# Returns a dictionary of the purchase count for each screen name
player_purchases = df["SN"].value_counts().to_dict()

In [76]:
# Retrieves the purchase count from the dictionary above using the top 5 list
top_5_purchase_count = [player_purchases[i] for i in top_5_sn]

In [77]:
# Creates group by object for performing desired aggregate functions
users_by_sn = df.groupby("SN")
# Creates a dictionary for screen names average purchase price
average_purchase_price = users_by_sn["Price"].mean().to_dict()

In [78]:
# Creates a list of the average purchase price for the top 5, retrieving from the dictionary
top_5_average_purchase = [round(average_purchase_price[i], 2) for i in top_5_sn]

In [79]:
top_5_spenders = pd.DataFrame({
    "SN": top_5_sn,
    "Purchase Count": top_5_purchase_count,
    "Average Purchase Price": top_5_average_purchase,
    "Total Purchase Value": top_5_total_purchase
}).set_index("SN")
top_5_spenders

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                    3.79                 18.96
Idastidru52               4                    3.86                 15.45
Chamjask73                3                    4.61                 13.83
Iral74                    4                    3.41                 13.62
Iskadarya95               3                    4.37                 13.10

In [110]:
# Top 5 Items Analysis
# Creates group by object for performing desired aggregate functions
items_grouped = df.groupby(["Item Name"])
# Creates a DF of items with their total purchase price summed
popular_items = items_grouped[["Price"]].count().reset_index()
popular_items

                           Item Name  Price
0                      Abyssal Shard      5
1     Aetherius, Boon of the Blessed      5
2                             Agatha      6
3                              Alpha      3
4                Alpha, Oath of Zeal      3
..                               ...    ...
174                             Wolf      8
175  Wolf, Promise of the Moonwalker      6
176                     Worldbreaker      4
177                 Yearning Crusher      3
178               Yearning Mageblade      5

[179 rows x 2 columns]

In [95]:
top_5_items = popular_items.nlargest(n=5, columns=["Price"])["Item Name"].to_list()
top_5_items

['Final Critic',
 'Oathbreaker, Last Hope of the Breaking Storm',
 'Extraction, Quickblade Of Trembling Hands',
 'Fiery Glass Crusader',
 'Nirvana']

In [82]:
# Creates dictionary of purchase counts for each unique item
item_purchases = df["Item Name"].value_counts().to_dict()
item_purchase_count = [item_purchases[i] for i in top_5_items]
item_purchase_count

[13, 12, 9, 9, 9]

In [119]:
item_price = items_grouped["Price"].sum()
top_item_total_value = [round(item_price[i], 2) for i in top_5_items]
top_item_total_value

[59.99, 50.76, 31.77, 41.22, 44.1]

In [118]:
top_item_price = []
for i in range(0, len(item_purchase_count)):
    item_prices = round(top_item_total_value[i] / item_purchase_count[i], 2)
    top_item_price.append(item_prices)
top_item_price

[4.61, 4.23, 3.53, 4.58, 4.9]

In [90]:
top_5_items = pd.DataFrame({
    "Item Name": top_5_items,
    "Purchase Count": item_purchase_count,
    "Average Purchase Price": top_item_price,
    "Total Purchase Value": top_item_total_value
}).set_index("Item Name")
top_5_items

,Purchase Count,Average Purchase Price,Total Purchase Value
Item Name,,,
Final Critic,13,4.61,59.99
"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
Fiery Glass Crusader,9,4.58,41.22
Nirvana,9,4.90,44.10

In [111]:
# Most Profitable Items Analysis
profitable_items = items_grouped[["Price"]].sum().reset_index()
profitable_items

                           Item Name  Price
0                      Abyssal Shard  13.35
1     Aetherius, Boon of the Blessed  16.95
2                             Agatha  18.48
3                              Alpha   6.21
4                Alpha, Oath of Zeal  12.15
..                               ...    ...
174                             Wolf  28.32
175  Wolf, Promise of the Moonwalker  26.88
176                     Worldbreaker  10.40
177                 Yearning Crusher  12.54
178               Yearning Mageblade  19.10

[179 rows x 2 columns]

In [112]:
most_profitable_items = profitable_items.nlargest(n=5, columns=["Price"])["Item Name"].to_list()
most_profitable_items

['Final Critic',
 'Oathbreaker, Last Hope of the Breaking Storm',
 'Nirvana',
 'Fiery Glass Crusader',
 'Singed Scalpel']

In [114]:
profitable_item_purchase_count = [item_purchases[i] for i in most_profitable_items]
profitable_item_purchase_count

[13, 12, 9, 9, 8]

In [120]:
profitable_items_total_value = [round(item_price[i], 2) for i in most_profitable_items]
profitable_items_total_value

[59.99, 50.76, 44.1, 41.22, 34.8]

In [122]:
profitable_item_price = []
for i in range(0, len(item_purchase_count)):
    item_prices = round(profitable_items_total_value[i] / profitable_item_purchase_count[i], 2)
    profitable_item_price.append(item_prices)
profitable_item_price

[4.61, 4.23, 4.9, 4.58, 4.35]

In [123]:
top_5_profitable_items = pd.DataFrame({
    "Item Name": most_profitable_items,
    "Purchase Count": profitable_item_purchase_count,
    "Average Purchase Price": profitable_item_price,
    "Total Purchase Value": profitable_items_total_value
}).set_index("Item Name")
top_5_profitable_items

,Purchase Count,Average Purchase Price,Total Purchase Value
Item Name,,,
Final Critic,13,4.61,59.99
"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
Nirvana,9,4.90,44.10
Fiery Glass Crusader,9,4.58,41.22
Singed Scalpel,8,4.35,34.80